#### OpenTofu Format: success
#### OpenTofu Init: success
#### OpenTofu Validate: success
#### OpenTofu Plan: success

<details><summary>Show Plan</summary>

```terraform
module.lambda_roles.aws_iam_role.bitstring_updater_lambda: Refreshing state... [id=zeroverify-bitstring-updater-lambda]
module.lambda_roles.aws_iam_role.issuer_lambda: Refreshing state... [id=zeroverify-issuer-lambda]
module.github_oidc.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::043189681060:oidc-provider/token.actions.githubusercontent.com]
module.secrets.aws_secretsmanager_secret.baby_jubjub_private_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:043189681060:secret:zeroverify/baby-jubjub-private-key-DTTklP]
module.dynamodb.aws_dynamodb_table.credentials: Refreshing state... [id=zeroverify-credentials]
module.dynamodb.aws_dynamodb_table.bit_indices: Refreshing state... [id=zeroverify-bit-indices]
module.lambda_roles.aws_iam_role.revocation_lambda: Refreshing state... [id=zeroverify-revocation-lambda]
module.secrets.aws_secretsmanager_secret.hmac_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:043189681060:secret:zeroverify/hmac-key-gV2ThR]
module.lambda_roles.aws_iam_role.free_lambda: Refreshing state... [id=zeroverify-free-lambda]
module.github_oidc.aws_iam_policy.lambda_deployment: Refreshing state... [id=arn:aws:iam::043189681060:policy/GitHubActionsLambdaDeployment]
module.github_oidc.aws_iam_role.infrastructure: Refreshing state... [id=ZeroVerifyGitHubActionsInfra]
module.github_oidc.aws_iam_role.lambda_deployment: Refreshing state... [id=ZeroVerifyGitHubActionsLambdaDeployment]
module.secrets.aws_secretsmanager_secret_version.baby_jubjub_private_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:043189681060:secret:zeroverify/baby-jubjub-private-key-DTTklP|terraform-20260318204548046200000004]
module.secrets.aws_secretsmanager_secret_version.hmac_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:043189681060:secret:zeroverify/hmac-key-gV2ThR|terraform-20260318204547976400000003]
module.lambda_roles.aws_iam_role_policy.bitstring_updater_lambda: Refreshing state... [id=zeroverify-bitstring-updater-lambda:bitstring-updater-lambda-policy]
module.github_oidc.aws_iam_role_policy_attachment.infrastructure_admin: Refreshing state... [id=ZeroVerifyGitHubActionsInfra-20260318183740036000000001]
module.github_oidc.aws_iam_role_policy_attachment.lambda_deployment_policy: Refreshing state... [id=ZeroVerifyGitHubActionsLambdaDeployment-20260318183740123100000002]
module.lambda_roles.aws_iam_role_policy.revocation_lambda: Refreshing state... [id=zeroverify-revocation-lambda:revocation-lambda-policy]
module.lambda_roles.aws_iam_role_policy.free_lambda: Refreshing state... [id=zeroverify-free-lambda:free-lambda-policy]
module.lambda_roles.aws_iam_role_policy.issuer_lambda: Refreshing state... [id=zeroverify-issuer-lambda:issuer-lambda-policy]
module.dynamodb.aws_dynamodb_table_item.bit_indices_metadata: Refreshing state... [id=zeroverify-bit-indices|bit_index|-1]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # module.github_oidc.aws_iam_policy.lambda_deployment will be updated in-place
  ~ resource "aws_iam_policy" "lambda_deployment" {
        id               = "arn:aws:iam::043189681060:policy/GitHubActionsLambdaDeployment"
        name             = "GitHubActionsLambdaDeployment"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::zeroverify-*",
                          - "arn:aws:s3:::zeroverify-*/*",
                        ]
                      - Sid      = "S3ArtifactUpload"
                    },
                  - {
                      - Action   = [
                          - "lambda:UpdateFunctionCode",
                          - "lambda:GetFunction",
                          - "lambda:PublishVersion",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:us-east-1:*:function:*"
                      - Sid      = "LambdaUpdate"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "ManagedBy" = "OpenTofu"
            "Project"   = "ZeroVerify"
        }
        # (6 unchanged attributes hidden)
    }

  # module.storage.aws_s3_bucket.lambda_artifacts will be created
  + resource "aws_s3_bucket" "lambda_artifacts" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "zeroverify-lambda-artifacts"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all                    = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.storage.aws_s3_bucket_lifecycle_configuration.lambda_artifacts will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "lambda_artifacts" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "abort-incomplete-uploads"
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + filter {
            }
        }
    }

  # module.storage.aws_s3_bucket_public_access_block.lambda_artifacts will be created
  + resource "aws_s3_bucket_public_access_block" "lambda_artifacts" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

Pushed by: @antonsakhanovych